fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДоговорИРеализаций</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда 
	
#Область СлужебныеПроцедурыИФункции

// Получает данные договоров и реализаций по ним.
// 
// Параметры:
//  ДатаНачала - Дата -  Дата начала указанного в обработке периода
//  ДатаОкончания - Дата - Дата окончания указанного в обработке периода
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - Выборка договоров и реализаций.
Функция ПолучитьДанныеДоговоров(ДатаНачала, ДатаОкончания) Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ВыполненныеКлиентуРаботы.Договор,
	|	ЕСТЬNULL(РеализацияТоваровУслуг.Ссылка, 0) КАК Реализация,
	|	ВКМ_ВыполненныеКлиентуРаботы.Клиент КАК Контрагент,
	|	ВКМ_ВыполненныеКлиентуРаботы.Регистратор.Специалист КАК Ответственный,
	|	ВКМ_ВыполненныеКлиентуРаботы.Договор.Организация КАК Организация
	|ИЗ
	|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы КАК ВКМ_ВыполненныеКлиентуРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО РеализацияТоваровУслуг.Договор = ВКМ_ВыполненныеКлиентуРаботы.Договор
	|		И РеализацияТоваровУслуг.Контрагент = ВКМ_ВыполненныеКлиентуРаботы.Клиент
	|ГДЕ
	|	ВКМ_ВыполненныеКлиентуРаботы.Договор.ВидДоговора = &ВидДоговора
	|	И ВКМ_ВыполненныеКлиентуРаботы.Регистратор.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ВыполненныеКлиентуРаботы.Клиент,
	|	ВКМ_ВыполненныеКлиентуРаботы.Договор,
	|	ЕСТЬNULL(РеализацияТоваровУслуг.Ссылка, 0),
	|	ВКМ_ВыполненныеКлиентуРаботы.Регистратор.Специалист,
	|	ВКМ_ВыполненныеКлиентуРаботы.Договор.Организация";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи;

	
	
КонецФункции


// Формирует документы РТиУ к списку договоров.
// 
// Параметры:
//  ДатаНачала - Дата -  Дата начала указанного в обработке периода
//  ДатаОкончания - Дата - Дата окончания указанного в обработке период
Процедура СформироватьРеализацииКДоговорам(ДатаНачала, ДатаОкончания) Экспорт
	
	Выборка = ПолучитьДанныеДоговоров(ДатаНачала, ДатаОкончания);
	
	ВсегоДоговоров = Выборка.Количество();
	
	Счетчик = 1;
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Реализация = 0 Тогда
			
			НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			ЗаполнитьЗначенияСвойств(НовыйДокумент, Выборка);
			
			Для Каждого СтрокаТЧ из НовыйДокумент.Услуги Цикл
				
				СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
				
			КонецЦикла;
			
			НовыйДокумент.СуммаДокумента = НовыйДокумент.Услуги.Итог("Сумма");
			
			Если ДатаОкончания > ТекущаяДатаСеанса() Тогда
				НовыйДокумент.Дата = ТекущаяДатаСеанса();
			Иначе 
				НовыйДокумент.Дата = ДатаОкончания;
			КонецЕсли;
			
			НовыйДокумент.Ответственный = Ответственный;
			НовыйДокумент.Комментарий = "Документ создан программно";
			
			НовыйДокумент.ВыполнитьАвтозаполнение();
			
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
					
		Иначе
			
			ДокументРеализация = Выборка.Реализация.ПолучитьОбъект();
			ДокументРеализация.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			
			Если ДатаОкончания > ТекущаяДатаСеанса() Тогда
				ДокументРеализация.Дата = ТекущаяДатаСеанса();
			Иначе 
				ДокументРеализация.Дата = ДатаОкончания;
			КонецЕсли;
			
			ДокументРеализация.Ответственный = Ответственный;
			ДокументРеализация.Комментарий = "Документ обновлен программно";
			
			ДокументРеализация.ВыполнитьАвтозаполнение();
			
//			ДокументРеализация.СуммаДокумента = ДокументРеализация.Услуги.Итог("Сумма");
			
						
			ДокументРеализация.Записать(РежимЗаписиДокумента.Проведение);
			
		КонецЕсли;
		
		ПроцентВыполнения = (Счетчик/ВсегоДоговоров)*100;
		ПроцентВыполнения = Окр(ПроцентВыполнения, 0);
		
		ДлительныеОперации.СообщитьПрогресс(ПроцентВыполнения, СокрЛП(Выборка.Договор));
		
		Счетчик = Счетчик + 1;
		
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли
